src/Catalogs/НастройкиЗаполненияБухОтчетности/НастройкиЗаполненияБухОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиЗаполненияБухОтчетности</name>
  <predefined>
    <items>
      <name>НеНастраивается</name>
      <description>Не настраивается</description>
    </items>
  </predefined>
  <attributes>
    <name>РедакцияФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ФормыБухгалтерскойОтчетности/ФормыБухгалтерскойОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФормыБухгалтерскойОтчетности</name>
  <enumValues>
    <name>Баланс</name>
  </enumValues>
  <enumValues>
    <name>ОФР</name>
  </enumValues>
  <enumValues>
    <name>ОИК</name>
  </enumValues>
  <enumValues>
    <name>ОДДС</name>
  </enumValues>
  <enumValues>
    <name>ОЦИС</name>
  </enumValues>
  <enumValues>
    <name>Пояснения1</name>
  </enumValues>
  <enumValues>
    <name>Пояснения2</name>
  </enumValues>
  <enumValues>
    <name>Пояснения3</name>
  </enumValues>
  <enumValues>
    <name>Пояснения4</name>
  </enumValues>
  <enumValues>
    <name>Пояснения5</name>
  </enumValues>
  <enumValues>
    <name>Пояснения6</name>
  </enumValues>
  <enumValues>
    <name>Пояснения7</name>
  </enumValues>
  <enumValues>
    <name>Пояснения8</name>
  </enumValues>
  <enumValues>
    <name>Пояснения9</name>
  </enumValues>
  <enumValues>
    <name>Пояснения10</name>
  </enumValues>
  <enumValues>
    <name>Пояснения11</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СтрокиБухОтчетности/СтрокиБухОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтрокиБухОтчетности</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.НастройкиЗаполненияБухОтчетности</owners>
  <attributes>
    <name>ФормаОтчетности</name>
    <type>
      <types>EnumRef.ФормыБухгалтерскойОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСтрокиПрошлогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопАлгоритм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регламентированная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОсновнаяСтрока</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлениеДопСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключитьВОтчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтрока</name>
    <type>
      <types>CatalogRef.СтрокиБухОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьГрафы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРасшифровки</name>
    <comment>Полное наименование для расшифровки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодЯчейки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодЯчейкиПрошлогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/НастройкиЗаполненияБухОтчетности/Forms/НастройкиЗаполненияОтчетности/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкаЗаполненияОтчетности") Тогда
		Настройка = Параметры.НастройкаЗаполненияОтчетности; //СправочникСсылка.НастройкиЗаполненияБухОтчетности
	КонецЕсли;
	
	НастраиваемаяБухгалтерскаяОтчетность.НастроитьКомандыГенерацииНастроек(ЭтотОбъект);
	
	ОбновитьРедакциюФормы(Настройка, РедакцияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЭлементыФормы("");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьЭлементыФормы(Команда)
	
	ОбновитьРедакциюФормы(Настройка, РедакцияФормы);
	
	Элементы.РедакцияФормы.Заголовок = ЗаголовокРедакцииФормы(РедакцияФормы);
	ОбновитьВидимостьЭлементов();
	
	ЗадатьОтборПоНастройке();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтроку(Команда)
	
	ПараметрыНовойСтроки = Новый Структура;
	ПараметрыНовойСтроки.Вставить("Родитель", Элементы.СтруктураСтрок.ТекущаяСтрока);
	ПараметрыНовойСтроки.Вставить("ОсновнаяСтрока", Неопределено);
	ПараметрыНовойСтроки.Вставить("ЭтоОсновнаяСтрока", Истина);
	ПараметрыНовойСтроки.Вставить("Регламентированная", Ложь);
	ПараметрыНовойСтроки.Вставить("ДобавлениеДопСтрок", Истина);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ПараметрыНовойСтроки", ПараметрыНовойСтроки);
	
	ОткрытьФорму("Справочник.СтрокиБухОтчетности.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

 &НаКлиенте
Процедура СоздатьДопСтроку(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыНовойСтроки = Новый Структура;
	ПараметрыНовойСтроки.Вставить("Родитель", Элементы.СтруктураСтрок.ТекущаяСтрока);
	ПараметрыНовойСтроки.Вставить("ОсновнаяСтрока", Элементы.ОсновныеСтроки.ТекущиеДанные.Ссылка);
	ПараметрыНовойСтроки.Вставить("ЭтоОсновнаяСтрока", Ложь);
	ПараметрыНовойСтроки.Вставить("Регламентированная", Ложь);
	ПараметрыНовойСтроки.Вставить("ДобавлениеДопСтрок", Ложь);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ПараметрыНовойСтроки", ПараметрыНовойСтроки);

	ОткрытьФорму("Справочник.СтрокиБухОтчетности.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	
	ОбновитьРедакциюФормы(Настройка, РедакцияФормы);
	ОбновитьЭлементыФормы("");
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураСтрокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СтруктураСтрок.ТекущиеДанные <> Неопределено Тогда
		ОсновныеСтроки.Параметры.УстановитьЗначениеПараметра("Родитель", Элементы.СтруктураСтрок.ТекущиеДанные.Ссылка);
		НастроитьКомандыСтрок(ДоступноСозданиеОсновныхСтрок(Элементы.СтруктураСтрок.ТекущиеДанные.ФормаОтчетности));
	Иначе
		ОсновныеСтроки.Параметры.УстановитьЗначениеПараметра("Родитель", Неопределено);
		НастроитьКомандыСтрок(Ложь);
		НастроитьКомандыДопСтрок(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСтрокиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ОсновныеСтроки.ТекущиеДанные <> Неопределено Тогда
		ДополнительныеСтроки.Параметры.УстановитьЗначениеПараметра("ОсновнаяСтрока", Элементы.ОсновныеСтроки.ТекущиеДанные.Ссылка);
		НастроитьКомандыДопСтрок(Элементы.ОсновныеСтроки.ТекущиеДанные.ДобавлениеДопСтрок);
	Иначе
		ДополнительныеСтроки.Параметры.УстановитьЗначениеПараметра("ОсновнаяСтрока", Неопределено);
		НастроитьКомандыДопСтрок(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Программно генерируемая команда создания настроек.
// 
// Параметры:
//  Команда - КомандаКомандногоИнтерфейса
&НаКлиенте
Процедура СгенерироватьНастройкиПоУмолчанию(Команда) Экспорт
	
	НастраиваемаяБухгалтерскаяОтчетностьКлиент.СгенерироватьНастройкиПоУмолчанию(Настройка, ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	
	Если Настройка = ПредопределенноеЗначение("Справочник.НастройкиЗаполненияБухОтчетности.НеНастраивается") Тогда
		Элементы.СтруктураСтрок.Видимость = Ложь;
		Элементы.ОсновныеСтроки.Видимость = Ложь;
		Элементы.ДополнительныеСтроки.Видимость = Ложь;
		Элементы.КартинкаИнформация.Видимость = Истина;
		Элементы.Информация.Видимость = Истина;
	Иначе
		Элементы.СтруктураСтрок.Видимость = Истина;
		Элементы.ОсновныеСтроки.Видимость = Истина;
		Элементы.ДополнительныеСтроки.Видимость = Истина;
		Элементы.КартинкаИнформация.Видимость = Ложь;
		Элементы.Информация.Видимость = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновныеСтрокиСоздатьСтроку", "Видимость", РедакцияФормы = "ФормаОтчета2025Кв1");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКомандыДопСтрок(ДопСтрокиДоступны)
	
	СтруктураКоманд = Новый Структура;
	
	СтруктураКоманд.Вставить("ДополнительныеСтрокиСоздатьДопСтроку");
	СтруктураКоманд.Вставить("ДополнительныеСтрокиКонтекстноеМенюСоздатьДопСтроку");
	
	Для Каждого Команда Из СтруктураКоманд Цикл
		ЭУ = Элементы.Найти(Команда.Ключ);
		Если ЭУ <> Неопределено Тогда
			ЭУ.Доступность = ДопСтрокиДоступны;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКомандыСтрок(ДоступностьКоманды)
	
	СтруктураКоманд = Новый Структура;
	
	СтруктураКоманд.Вставить("ОсновныеСтрокиСоздатьСтроку");

	Для Каждого Команда Из СтруктураКоманд Цикл
		ЭУ = Элементы.Найти(Команда.Ключ);
		Если ЭУ <> Неопределено Тогда
			ЭУ.Доступность = ДоступностьКоманды;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьОтборПоНастройке()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СтруктураСтрок, "Владелец", Настройка, ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьРедакциюФормы(Настройка, РедакцияФормы)
	
	РедакцияФормы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Настройка, "РедакцияФормы");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокРедакцииФормы(РедакцияФормы)
	
	Заголовок = "";
	
	Если РедакцияФормы = "ФормаОтчета2025Кв1" Тогда
		Заголовок = "Форма №157н, утверждена приказом Минфина России от 04.10.2023г.";
	ИначеЕсли РедакцияФормы = "ФормаОтчета2019Кв1" Тогда
		Заголовок = "Форма №66н от 02.07.2010 г., в ред. приказа Минфина России от 19.04.2019 № 61н";
	КонецЕсли;
	
	Возврат Заголовок;

КонецФункции

&НаКлиенте
Функция ДоступноСозданиеОсновныхСтрок(ФормаОтчетности)
	
	ДоступностьКоманды = Ложь;
	
	Если ФормаОтчетности = ПредопределенноеЗначение("Перечисление.ФормыБухгалтерскойОтчетности.Баланс")
		Или ФормаОтчетности = ПредопределенноеЗначение("Перечисление.ФормыБухгалтерскойОтчетности.ОФР") Тогда
		ДоступностьКоманды = Истина;
	КонецЕсли;
	
	Возврат ДоступностьКоманды;
	
КонецФункции

#КонецОбласти
